# Pandas : Python 데이터 분석 라이브러리
R언어의 데이터프레임과 같은 이름의 데이터프레임 구조에 데이터를 집어넣고
다양한 조작으로 데이터 분석을 편리하게 해 줌

[파이썬으로 배우는 알고리즘 트레이딩 13장](https://wikidocs.net/2873)

[pandas](http://pandas.pydata.org/)

[pandas_datareader](https://pandas-datareader.readthedocs.io)

In [104]:
import numpy as np
import pandas as pd
import datetime
import os

# import 1차열, 2차열
from pandas import Series, DataFrame

# import pandas_datareader
import pandas_datareader.data as web

## Series
1차원 데이터

In [14]:
# Data Structures : Series 
kakao = Series([92600, 92400, 92100, 94300, 92300])
print(kakao)
print('=================')

# 인덱스 처리.
kakao2 = Series([92600, 92400, 92100, 94300, 92300], index=['2016-02-19',
                                                            '2016-02-18',
                                                            '2016-02-17',
                                                            '2016-02-16',
                                                            '2016-02-15'])
print(kakao2)
print('=================')

# 인덱스로 데이터 찾기
print(kakao2['2016-02-19'])
print(kakao2['2016-02-18'])
print('=================')

# 인덱스 출력
for date in kakao2.index:
    print(date)
print('=================')

# 데이터 출력
for ending_price in kakao2.values:
    print(ending_price)
print('=================')

# 데이터 수정
kakao2['2016-02-19'] = 50000
print(kakao2)

0    92600
1    92400
2    92100
3    94300
4    92300
dtype: int64
=================
2016-02-19    92600
2016-02-18    92400
2016-02-17    92100
2016-02-16    94300
2016-02-15    92300
dtype: int64
=================
92600
92400
=================
2016-02-19
2016-02-18
2016-02-17
2016-02-16
2016-02-15
=================
92600
92400
92100
94300
92300
=================
2016-02-19    50000
2016-02-18    92400
2016-02-17    92100
2016-02-16    94300
2016-02-15    92300
dtype: int64

In [11]:
# 동일 인덱스 예제
mine   = Series([10, 20, 30, 50], index=['naver', 'sk', 'kt','sm'])
friend = Series([10, 30, 20], index=['kt', 'naver', 'sk'])

#
merge = mine + friend
print(merge)

merge = mine - friend
print(merge)

kt       40.0
naver    40.0
sk       40.0
sm        NaN
dtype: float64
kt       20.0
naver   -20.0
sk        0.0
sm        NaN
dtype: float64

## DataFrame
2차원 데이터

In [7]:
# Data Structures : DataFrame
raw_data = {'col0': [1, 2, 3, 4],
            'col1': [10, 20, 30, 40],
            'col2': [100, 200, 300, 400]}

data = DataFrame(raw_data)
print(data)

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400

In [106]:
daeshin = {'open':  [11650, 11100, 11200, 11100, 11000],
           'high':  [12100, 11800, 11200, 11100, 11150],
           'low' :  [11600, 11050, 10900, 10950, 10900],
           'close': [11900, 11600, 11000, 11100, 11050]}

# columns 순서 지정.
daeshin_day = DataFrame(daeshin, columns=['close','open', 'high', 'low' ])
print(daeshin_day)

# 인덱스 처리
date = ['16.02.29', '16.02.26', '16.02.25', '16.02.24', '16.02.23']
daeshin_day = DataFrame(daeshin, columns=['open', 'high', 'low', 'close'], index=date)
print(daeshin_day)

# 데이터 수정 
#TODO 값으로 index 찾아보기 
daeshin_day['open']['16.02.29']= 50000
print(daeshin_day)

# columns 데이터 선택.
close = daeshin_day['close']
print(close)
print(type(close))

# index 데이터 선택
## day_data = daeshin_day.ix['16.02.24'] #deprecated 
day_data = daeshin_day.loc['16.02.24']
print(day_data)
print(type(day_data))

## 인덱스 출력
for date in day_data.index:
    print(date)
print('=================')

## 데이터 출력
for ending_price in day_data.values:
    print(ending_price)
print('=================')

   close   open   high    low
0  11900  11650  12100  11600
1  11600  11100  11800  11050
2  11000  11200  11200  10900
3  11100  11100  11100  10950
4  11050  11000  11150  10900
           open   high    low  close
16.02.29  11650  12100  11600  11900
16.02.26  11100  11800  11050  11600
16.02.25  11200  11200  10900  11000
16.02.24  11100  11100  10950  11100
16.02.23  11000  11150  10900  11050
           open   high    low  close
16.02.29  50000  12100  11600  11900
16.02.26  11100  11800  11050  11600
16.02.25  11200  11200  10900  11000
16.02.24  11100  11100  10950  11100
16.02.23  11000  11150  10900  11050
16.02.29    11900
16.02.26    11600
16.02.25    11000
16.02.24    11100
16.02.23    11050
Name: close, dtype: int64
<class 'pandas.core.series.Series'>
open     11100
high     11100
low      10950
close    11100
Name: 16.02.24, dtype: int64
<class 'pandas.core.series.Series'>
open
high
low
close
=================
11100
11100
10950
11100
=================

## [한눈에보기](http://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html)

In [23]:
# Series
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)

# DataFrame
dates = pd.date_range('20130101', periods=10)
print(dates)

# random.randn 0 ~ 1 난수 생성, 10x4
# columns a,b,c,d
df = pd.DataFrame(np.random.randn(10, 4), index=dates, columns=list('ABCD'))
df

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64
DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08',
               '2013-01-09', '2013-01-10'],
              dtype='datetime64[ns]', freq='D')

                   A         B         C         D
2013-01-01  0.733722 -1.457404 -0.546190 -0.262080
2013-01-02  0.967098 -1.430194 -0.868304 -0.580717
2013-01-03  0.352933 -0.264847  0.704211  0.457088
2013-01-04 -0.360783  2.017644 -1.662974  0.748131
2013-01-05  1.676131 -0.202910  0.408564 -0.755456
2013-01-06  0.868710 -0.399307 -0.426499 -0.577027
2013-01-07 -1.309265  1.235691  0.755532  1.923553
2013-01-08 -0.832225 -1.789602  0.032497 -0.283876
2013-01-09 -1.150045 -0.730558  1.700666 -0.231965
2013-01-10 -0.548704 -0.013221  1.045975 -0.507619

In [24]:
# 데이터 생성
df2 = pd.DataFrame({'A': 1.,
'B': pd.date_range('20130101', periods=6), #pd.Timestamp('20130102'),
'C': pd.Series(1, index=list(range(6)), dtype='float32'),
'D': np.array([3] * 6, dtype='int32'),
'E': pd.Categorical(["test", "train", "test", "train", "ABC", "CCC"]),
'F': 'foo'}) 

# 데이터 출력
df2

     A          B    C  D      E    F
0  1.0 2013-01-01  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-03  1.0  3   test  foo
3  1.0 2013-01-04  1.0  3  train  foo
4  1.0 2013-01-05  1.0  3    ABC  foo
5  1.0 2013-01-06  1.0  3    CCC  foo

In [13]:
# column type보기
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
# 인덱스 위에서 부터 n 데이터
df2.head(1)

     A          B    C  D     E    F
0  1.0 2013-01-02  1.0  3  test  foo

In [29]:
# 인덱스 마지막에서 n 데이터
df2.tail(3)

     A          B    C  D      E    F
3  1.0 2013-01-04  1.0  3  train  foo
4  1.0 2013-01-05  1.0  3    ABC  foo
5  1.0 2013-01-06  1.0  3    CCC  foo

In [30]:
# index
df2.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08',
               '2013-01-09', '2013-01-10'],
              dtype='datetime64[ns]', freq='D')

In [39]:
# columns
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [105]:
# 엑셀 파일 읽어오기
sample = pd.read_excel(os.getcwd()+'/res/sample.xlsx')
sample.to_csv('output.csv')

In [48]:
# to json.
df2.to_json()

'{"A":{"0":1.0,"1":1.0,"2":1.0,"3":1.0,"4":1.0,"5":1.0},"B":{"0":1356998400000,"1":1357084800000,"2":1357171200000,"3":1357257600000,"4":1357344000000,"5":1357430400000},"C":{"0":1.0,"1":1.0,"2":1.0,"3":1.0,"4":1.0,"5":1.0},"D":{"0":3,"1":3,"2":3,"3":3,"4":3,"5":3},"E":{"0":"test","1":"train","2":"test","3":"train","4":"ABC","5":"CCC"},"F":{"0":"foo","1":"foo","2":"foo","3":"foo","4":"foo","5":"foo"}}'

In [50]:
# to json : columns, index, data
df2.to_json(orient='split')

'{"columns":["A","B","C","D","E","F"],"index":[0,1,2,3,4,5],"data":[[1.0,1356998400000,1.0,3,"test","foo"],[1.0,1357084800000,1.0,3,"train","foo"],[1.0,1357171200000,1.0,3,"test","foo"],[1.0,1357257600000,1.0,3,"train","foo"],[1.0,1357344000000,1.0,3,"ABC","foo"],[1.0,1357430400000,1.0,3,"CCC","foo"]]}'

In [52]:
# to json : schema, fields, data
df2.to_json(orient='table')

'{"schema": {"fields":[{"name":"index","type":"integer"},{"name":"A","type":"number"},{"name":"B","type":"datetime"},{"name":"C","type":"number"},{"name":"D","type":"integer"},{"name":"E","type":"any","constraints":{"enum":["ABC","CCC","test","train"]},"ordered":false},{"name":"F","type":"string"}],"primaryKey":["index"],"pandas_version":"0.20.0"}, "data": [{"index":0,"A":1.0,"B":"2013-01-01T00:00:00.000Z","C":1.0,"D":3,"E":"test","F":"foo"},{"index":1,"A":1.0,"B":"2013-01-02T00:00:00.000Z","C":1.0,"D":3,"E":"train","F":"foo"},{"index":2,"A":1.0,"B":"2013-01-03T00:00:00.000Z","C":1.0,"D":3,"E":"test","F":"foo"},{"index":3,"A":1.0,"B":"2013-01-04T00:00:00.000Z","C":1.0,"D":3,"E":"train","F":"foo"},{"index":4,"A":1.0,"B":"2013-01-05T00:00:00.000Z","C":1.0,"D":3,"E":"ABC","F":"foo"},{"index":5,"A":1.0,"B":"2013-01-06T00:00:00.000Z","C":1.0,"D":3,"E":"CCC","F":"foo"}]}'

In [55]:
#엑셀 파일 만들기
df2.to_excel("output.xlsx")

In [57]:
#csv 파일 만들기
df2.to_csv("output.csv")

In [64]:
# 통계 생성
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.039757  -0.303471   0.114348  -0.006997
std     1.016916   1.195068   1.004985   0.827973
min    -1.309265  -1.789602  -1.662974  -0.755456
25%    -0.761345  -1.255285  -0.516267  -0.559675
50%    -0.003925  -0.332077   0.220531  -0.272978
75%     0.834963  -0.060643   0.742702   0.284825
max     1.676131   2.017644   1.700666   1.923553

In [75]:
# Selection by Label
df.loc[dates[2]]

A    0.352933
B   -0.264847
C    0.704211
D    0.457088
Name: 2013-01-03 00:00:00, dtype: float64

In [76]:
# Selection by Label
df.loc['20130102':'20130104', ['A', 'D']]

                   A         D
2013-01-02  0.967098 -0.580717
2013-01-03  0.352933  0.457088
2013-01-04 -0.360783  0.748131

In [78]:
# Selection by Label
df.loc[dates[0], 'A']

0.7337223688867338

In [81]:
# Selection by Position
# df.iloc[3]
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.360783  2.017644
2013-01-05  1.676131 -0.202910

In [83]:
# Selection by Position
df.iat[1, 1]

-1.4301940352357274

In [94]:
# Boolean Indexing
# df[df.A > 0]
df[df > 0]
# df2[df2.E == "test"]

                   A         B         C         D
2013-01-01  0.733722       NaN       NaN       NaN
2013-01-02  0.967098       NaN       NaN       NaN
2013-01-03  0.352933       NaN  0.704211  0.457088
2013-01-04       NaN  2.017644       NaN  0.748131
2013-01-05  1.676131       NaN  0.408564       NaN
2013-01-06  0.868710       NaN       NaN       NaN
2013-01-07       NaN  1.235691  0.755532  1.923553
2013-01-08       NaN       NaN  0.032497       NaN
2013-01-09       NaN       NaN  1.700666       NaN
2013-01-10       NaN       NaN  1.045975       NaN

## Pandas pandas_datareader 사용하기

In [95]:
start = datetime.datetime(2019, 1, 1)
end = datetime.datetime(2019, 2, 15)
samsung = web.DataReader("005930.KS", "yahoo", start, end)
samsung

             High    Low   Open  Close    Volume  Adj Close
Date
2019-01-02  39400  38550  39400  38750   7847664      38750
2019-01-03  38550  37450  38300  37600  12471493      37600
2019-01-04  37600  36850  37450  37450  14108958      37450
2019-01-07  38900  37800  38000  38750  12748997      38750
2019-01-08  39200  37950  38000  38100  12756554      38100
2019-01-09  39600  38300  38650  39600  17452708      39600
2019-01-10  40150  39600  40000  39800  14731699      39800
2019-01-11  40550  39950  40350  40500  11661063      40500
2019-01-14  40700  39850  40450  40050  11984996      40050
2019-01-15  41100  39850  40050  41100  11492756      41100
2019-01-16  41450  40700  41150  41450   8491595      41450
2019-01-17  42100  41450  41700  41950  11736903      41950
2019-01-18  42400  41950  42000  42300  11029256      42300
2019-01-21  42750  41900  42700  42750  11355701      42750
2019-01-22  42850  41850  42750  42150   9964356      42150
2019-01-23  42250  41350  41350  42000  11071079      42000
2019-01-24  43100  42350  43050  43050  14747623      43050
2019-01-25  44750  43750  44300  44750  22789395      44750
2019-01-28  45500  44600  45000  45050  17998914      45050
2019-01-29  45500  44350  45050  45500  16215017      45500
2019-01-30  46400  44800  44800  46400  17505980      46400
2019-01-31  47050  46150  46650  46150  21621145      46150
2019-02-01  46950  46250  46650  46350  13832454      46350

In [96]:
start = datetime.datetime(2019, 1, 1)
end = datetime.datetime(2019, 2, 15)
aapl = web.DataReader('AAPL', 'iex', start, end)
aapl

                open      high       low     close    volume
date
2019-01-02  154.2285  158.1716  153.5713  157.2455  37039737
2019-01-03  143.3651  145.0976  141.3935  141.5827  91312195
2019-01-04  143.9127  147.9154  143.1858  147.6268  58607070
2019-01-07  148.0649  148.1943  145.2769  147.2982  54777764
2019-01-08  148.9212  151.1716  147.8857  150.1061  41025314
2019-01-09  150.6438  153.8700  148.9909  152.6552  45099081
2019-01-10  151.8487  153.3124  150.2157  153.1431  35780670
2019-01-11  152.2270  153.0435  150.8629  151.6396  27023241
2019-01-14  150.2057  150.6239  148.5827  149.3594  32439186
2019-01-15  149.6282  152.7349  149.4091  152.4162  28710324
2019-01-16  152.4262  155.2142  152.3465  154.2783  30569706
2019-01-17  153.5414  156.9866  152.6054  155.1943  29821160
2019-01-18  156.8273  157.2057  155.3144  156.1502  33751023
2019-01-22  155.7420  156.0606  151.9682  152.6453  30393970
2019-01-23  153.4916  154.4774  151.0521  153.2626  23130570
2019-01-24  153.4518  153.8202  151.0919  152.0478  25441549
2019-01-25  154.8159  157.4546  153.6609  157.0862  33547893
2019-01-28  155.1246  155.6623  153.0037  155.6324  26192058
2019-01-29  155.5827  157.4546  153.4518  154.0194  41587239
2019-01-30  162.5528  165.4404  159.5457  164.5442  61109780
2019-01-31  165.4005  168.2782  163.8572  165.7291  40739649
2019-02-01  166.2469  168.2583  165.2213  165.8088  32668138
2019-02-04  166.6950  170.9219  166.5655  170.5186  31495582
2019-02-05  172.1217  174.3322  171.6140  173.4361  36101628
2019-02-06  173.9041  174.8201  172.1148  173.4958  28239591
2019-02-07  171.6637  173.1971  169.6125  170.2099  31741690
2019-02-08  168.9900  170.6600  168.4200  170.4100  23819966
2019-02-11  171.0500  171.2100  169.2500  169.4300  20993425
2019-02-12  170.1000  171.0000  169.7000  170.8900  22283523
2019-02-13  171.3900  172.4800  169.9200  170.1800  22490233
2019-02-14  169.7100  171.2615  169.3800  170.8000  21835747
2019-02-15  171.2500  171.7000  169.7500  170.4200  24626814